
"""
关于空间使用
printn_01 演示了for-each来循环打印，空间使用O(1)
printn_02 演示了递归算法来打印，空间使用O(n)


关于算法效率
解决算法的效率问题与算法的设计是否巧妙有关系

#什么是数据结构
    带结构的书籍元素的集合
    数据结构由一个四元组来表示 data_structure(D数据, L逻辑结构, S存储结构, O运算)


##抽象：描述数据类型的方法不依赖于具体实现
    与存放数据的机器无关
    与数据存储的物理结构无关
    与实现操作的算法和编程语言无关

##逻辑结构
    线性结构
    树形结构
    图形结构
    集合结构
##存储结构
    顺序存储结构
    链式存储结构

#抽象数据类型（Abstract Data Type）
    抽象性：定义数据类型只考虑使用层面，不需要考虑底层实现细节
    扩展性：由已有数据类型扩展数据类型
    抽象数据类型有一个三元组来表示，ADT(D, L, o)
##数据类型
    是程序设计语言中用来刻画操作对象的特性的一个值的集合和定义在此集合上的一组操作的总称
    数据对象集
    数据集合相关联的操作集


#什么是算法Algorithm

##算法
    一个有限的指令集
    输入：接受一些输入（有些情况下不需要输入）
    输出：产生输出
    有限性：一定在有限步骤之后终止
    确定性：每一条指令必须有明确的指标，不可以有歧义，且在计算机能处理的范围内

##算法复杂度分析
    时间复杂度：

        问题提出：T(N, I) N为问题的规模，I为输入

        选用数据模型：T(N, I)=∑ti*ei(N, I)  t为语句运行的时间，e为语句运行的时间

        对(N, I)作分析：最好、最坏、平均

                 ~
        渐进性态：T(N)

##渐进表达式分析方法

"""



